.class public Lcom/android/settings/kashi/Utils;
.super Ljava/lang/Object;


# static fields
.field private static final short:[S


# direct methods
.method static constructor <clinit>()V
    .locals 52

    const v0, 0x77

    new-array v0, v0, [S

    fill-array-data v0, :array_0

    sput-object v0, Lcom/android/settings/kashi/Utils;->short:[S

    return-void

    nop

    :array_0
    .array-data 2
        0x8acs
        0x8a1s
        0x8b9s
        0x8afs
        0x8b5s
        0x8b4s
        0x8efs
        0x8a4s
        0x8a5s
        0x8b6s
        0x8a9s
        0x8a3s
        0x8a5s
        0x89fs
        0x8a9s
        0x8aes
        0x8a6s
        0x8afs
        0x89fs
        0x8a9s
        0x8b4s
        0x8a5s
        0x8ads
        0x89fs
        0x8abs
        0x8a1s
        0x8b3s
        0x8a8s
        0x8a9s
        0xb19s
        0xb28s
        0xb20s
        0xb2es
        0xb2cs
        0xb28s
        0x294s
        0x299s
        0x281s
        0x297s
        0x28ds
        0x28cs
        0x2d7s
        0x28bs
        0x28cs
        0x297s
        0x28as
        0x299s
        0x29fs
        0x29ds
        0x2a7s
        0x291s
        0x296s
        0x29es
        0x297s
        0x2a7s
        0x291s
        0x28cs
        0x29ds
        0x295s
        0x2a7s
        0x293s
        0x299s
        0x28bs
        0x290s
        0x291s
        0xbb1s
        0xbbcs
        0xbf7s
        0xbbcs
        0xbbds
        0xbaes
        0xbb1s
        0xbbbs
        0xbbds
        0xb87s
        0xbb1s
        0xbb6s
        0xbbes
        0xbb7s
        0xb87s
        0xbaes
        0xbbds
        0xbaas
        0xbabs
        0xbb1s
        0xbb7s
        0xbb6s
        0xb87s
        0xbbbs
        0xbb9s
        0xbaas
        0xbbcs
        0xb87s
        0xbbas
        0xbbfs
        0xb45s
        0xb48s
        0xb03s
        0xb48s
        0xb49s
        0xb5as
        0xb45s
        0xb4fs
        0xb49s
        0xb73s
        0xb42s
        0xb4ds
        0xb41s
        0xb49s
        0xb73s
        0xb45s
        0xb42s
        0xb73s
        0xb4es
        0xb4ds
        0xb42s
        0xb42s
        0xb49s
        0xb5es
    .end array-data
.end method

.method public static K̵̡̢̥͚̫̻͎̺̤̫̻̯̫̎̌͘͘͜͝͝͠n̶̬͕̈́̋͗p͘ļ̵̸̮̫̲͙̫̜̹̖̦̼͑́̑̌͐͑̋͗͝c̶̷̢̛͓͚͎͎̦͈̥͕̯̺̦̹͚̱̾͂̂̒̎̃͊̈̂͐̑͊̈́̇̄̈́͘̚͜͜͜͜͝͝ơ̡̤̦̲̲͈̱̱͚̹̘͎͕͙̂͗̅́̈́̏̌͝ā̷͓̩̭̤͎̪̲͈̠̙͓̭̟̘̮̱̌͑̉̑̃͋̎͑̈̌̋̎͌̃̎̂͆̈͑͋̄̑͊͑͗̌̃̌͌̈́̈́͋̚͜͜͝͠͠͝a̴̸̻͕̤̦͗̑̑͝͝n͈k̶̴̴̨̡̛̺̱̯̯͉̗̘̥͈͙̹̦͎̯̮͊̊̄͗̃͐̊̈̈́̈̈̈́̃͑̊̑̚͘ḩ̸̴̴̛̟͇̠̫̹̩̪̘̗̭̯̅͑̈̂͑̈́͂͊̚͜͝͝ȩ̸̸̧̧̧̢̪͉̮̗͚̱̺̙͖̬̫̍̂̅͂̎͂̃̅̔́͜͠͝͝ͅȁt(Ljava/lang/Object;III)Ljava/lang/String;
    .locals 1

    invoke-static {}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->ţ̴̶̹̖͉̭̔̂͌̈̑͒͐̚͘͝Ḃ̸̛̪̮̜̖̖͗̋̍̽̀̎̑͌͘ͅu͚͐̈̃ư̶͈̙̥͎̭͓͇̹̫̮͉͚̍̆̌͌͗̿̈́̈͗̀̾́̉͌͋͋͜e̸̷̸̢̢̘̙͎̩̦̭͕͕͕͑̑̀̂̔̀̃̎̚ě̶̮̗̝̗͈̓̃̈́̂̀̈͌̔͌̌͋͝ţ̸̵̸͈͎̱̫̝̦̹͎͇͎̱̲̫̼̱̹̘͓̲͈̋̐̿͋̃͌̈́͂̃̏̌̇̿̓̿͋̋͋̋̃͋̑͘̚͜ͅţ̴̢̗͎̯̩̰͌̽͒͐͑͌ö̸̯̘̗́͂̆͋͒̌a̛̖͓̋͂̏̈́̑̍̈́̌͜͜͝K̋̆ơ̴̪̝͉̿̉͗͂̂̂̈́͘͝B̥̹̺͕͈̿̏̔͋̆͘͝ö̵̞̹̺̺̼̖̫̖͕͈̙̽̂̌̃̃͑͘͜͝l̀ő̶͓̲̀ǒ̜̥͓͈̈́͌h̢̢̙̑͜t̪̲͓͖̑̃̕a͗u̹̗͝()I

    move-result v0

    if-gtz v0, :cond_0

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->e͌ẽ̷͈ä̫a̡̢̹̺͎͈̠̫͓͗̋̈͝K̶̨̛͈̗̗̀͘͝͝a̶̸̹̺̭̯͉͚̯̗̭͎̺͖͚̫̰̫͗̌͋̌̈͊̽̄̾̀̄̚̚͝n̴̶̶̛̪̝͓̺̫̭͚̤͈̫̻̂̈́̈́̉̂͂̑͊͗͗̂́͘̚͜͝͠k̸̟̈́̑̃͠ǘ͓̩͓̌̐͘͝K̶̸̶̨̯͎̦̟̘͈̤̮̔c̨̛̟̪͕̭͒́̅̀̓̚̚ȩ̶̸̸̵̥̹͙͈̫̫̗̯̮̹̌̎̅́̌́̌̄̒̀͑̌͌̂͑͗͠͝͝p̪̘̦̂͘͘ơ̲͙̼̹̞̫͓͕̖͗̿̌͂̑̂͂͘͜͝͠͠͝Ķ̗̌a̸̸̺̞̰̖̘̭̋̿͂̔̎͑͝h̸̨͎̦̬̲̆͌͐͆̂̓͋̈́̅̚͘͘͜͠͝ơ̷̴̫̥̺͉̰̺͓͈̝̥͓͕̯̰̾̐͗̂̃̈͑̇̾̍̈̅̔̓͜͝͝ű̧̢͎̯̫̏̋͒̿͜([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_0
    return-object v0

    :cond_0
    const v0, 0x0

    goto :goto_0
.end method

.method public static a̰ķ̶̶̶̷̸̷̸̧̛̛̖̺̠̪͈̫̤̘̹̗͙̫͈̯̫̺̰͓̫̘̗̤̮̫͙͚̖̅̀̽͗̀̈́̂̿̈́̋̄͐̈́͗̽̈́̆̂͗̋̏̇͗̈̚͘̚͜͝͠͠͝͝͝͝͝͝ͅnă͎͕͈̋̅͘͝e̢͎̯̭̫̒̂ǹ̤̭̗̰̏̄͜ͅȩ̧̡̘̜͆̉̾̈́́̈́̋̅ť̛͙̺̜̠l̂P̢̍â̶̶̴̻̯̭͓̥̫̹̫͚̮̹͕̪̫̱̽̃̎͑̓̀̃̐͝͝͝c̭̓̀͌̿͝͝ţ̵̡̫̖̪̺̰͚͎̱̮̬̐̈̈̃͌͑̌͠͝õ̫̺͉̯̃̔̎̈̑̃̃͜ao̵̷̫̘̖̯̐̑̔͜͝e̸̲̗̥̮̠̿̋́̕͠ŭ̴̷͚̘̘͎͂̌͐̋̌͋̌̍̑͋͠å̶̢̱͚̥͈͉͖͗̿̋̀̋͌͘̚͜o̷̴̸̗̞̫̞̬̟͎͎̰̫͋́̈͗̾̄͌̂͒͌̇͌̄͠(Ljava/lang/Object;III)Ljava/lang/String;
    .locals 1

    invoke-static {}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->P͉ķ̩͕̥͋͗ą͉͕̥̥͎̜̈̅̈́͝k̵̷̨̨̧̧͖̞̥͈̮͓͎͎̪̂͑̑̂̓̐̂̋͝͝ṋ̵̢̢̡̥͕͊́̎̌Ķ̷̶̛̙̫̦̪̙̟̺̎͌̑̋̌͑̂̎͘ơ̸̦̥̂̈́̔̚͠͠ë͈̮͋̄̾Kh̶̷̸̗̫̤͕͚͚̘̞̮̄̋̄̐̓̋͑͗͐K̂p̵̷̪̘̱͕̰͈͐̄̕͘͜͜PB̨̛̘͕̗̫͉̱̫͙̥̯͕͕̰̘̤̤̦͗͗͊̃͋̆̃͐͗́͠B̷̷̤͇̹̋̅̄̋͜͠t̴̤̙̚Ķ̶̧̩̙̮̩̤̩̭̺̺̮͈̍̈͌̂̋̒̔̂̒̿̍̏̌͌̚͝͝at̖̥̠͕͌͊a̸̰̱͂̈́ȩ̶̶̛̛̛̺̩͉̖̱̦͈̫͙̫̥̻͎̯̈̋͌̄͑͂̿͗̌̅͑͂̍̉͘͘̚͜͜͜͝K͚̦̦̫͙̘̺͗͆̅͐̆Ǩ̢̘̠̫̜̼̦̅̅̚()I

    move-result v0

    if-gez v0, :cond_0

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/kashi/settings/view/AboutSettingsHelper;->n̸̲̄̅ù͊t̚h͚B̸̶̸̧̨̛̤̪̘͎͕̫͎̃̆̃͒̈́̃̌̈́̑͒̄̀͘̚͝k̸̛̛̫̫͋̂͌̋͊͑͊̈o̸̸̧̭͈̖͚̟͚̠̖̫͕̿͑̑̍̅̌̈̌͂̕͠͝͝h̶̶̨̢͚̗̭͈̠̭̯̗͉̩̼̫̘̟̞̹̓̃̑̌̎̌̌͆̅͋̾̐͐̆͝͝on̸̛̟͂͌͑̒̏̂̇͆ą͎̮ȃ̸̧̧͎͕͓̗̪̋͂̈́́̚ň̵̡̢̯͚̀̿̀͗̈́̂̿̚͘ü̶̴̸̸̸̧̺̹̦͉̺̘̱̲̦̖̜̫͎̫̩͙͚̱̻̅͌̅̇̈́̍̎̆̏̿́̄̄̎̏͑̈́̈́͘̚͝ņ̹̃̈́B̵͕̮̹̲̈́̆̏̋̃K͓͙̭̺h͎̀̎͌̄͜ḩ̶̷̧̢̛̛̮̼͓͓̱̄̂͌͗̔̂̉̉̂̈̄̋P̶̎͗̎͝ṯ̴͎̪͕͈̫̥̙͗̂̌̄̃͋̔͝ņ̥̦͉̐̄͝([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_0
    return-object v0

    :cond_0
    const v0, 0x0

    goto :goto_0
.end method

.method public static a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I
    .locals 1

    invoke-static {}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->P͉ķ̩͕̥͋͗ą͉͕̥̥͎̜̈̅̈́͝k̵̷̨̨̧̧͖̞̥͈̮͓͎͎̪̂͑̑̂̓̐̂̋͝͝ṋ̵̢̢̡̥͕͊́̎̌Ķ̷̶̛̙̫̦̪̙̟̺̎͌̑̋̌͑̂̎͘ơ̸̦̥̂̈́̔̚͠͠ë͈̮͋̄̾Kh̶̷̸̗̫̤͕͚͚̘̞̮̄̋̄̐̓̋͑͗͐K̂p̵̷̪̘̱͕̰͈͐̄̕͘͜͜PB̨̛̘͕̗̫͉̱̫͙̥̯͕͕̰̘̤̤̦͗͗͊̃͋̆̃͐͗́͠B̷̷̤͇̹̋̅̄̋͜͠t̴̤̙̚Ķ̶̧̩̙̮̩̤̩̭̺̺̮͈̍̈͌̂̋̒̔̂̒̿̍̏̌͌̚͝͝at̖̥̠͕͌͊a̸̰̱͂̈́ȩ̶̶̛̛̛̺̩͉̖̱̦͈̫͙̫̥̻͎̯̈̋͌̄͑͂̿͗̌̅͑͂̍̉͘͘̚͜͜͜͝K͚̦̦̫͙̘̺͗͆̅͐̆Ǩ̢̘̠̫̜̼̦̅̅̚()I

    move-result v0

    if-gtz v0, :cond_0

    invoke-static {p0}, Lcom/kashi/settings/view/AboutSettingsHelper$1;->ḻ̸̟͆̋̅͜t͙a̵̴͚̮͌̾̏͠e͉͉͚͒̾͜͠h̵̸̢̢̛̤̫͓̞̀̋͌̾͘͠Ka̷̠͎̘͚̮͈̤̫̜͕̺̗̭̹̰̐͂̏̔̿͆̂̌̈̋͌͆̔̄͒͌͂͘͝pä̷̸̴̯̟̺̺̦̘̆͌̂̈̋̃͠͝t̠̥͌a̰̥̩͓̐̅͊ḵ̷̛̛̥͇̂̋̿̅̚a̷̶̴̸̲͉̩͚̖͉͌́̂̎̃̎̌̚͘͝͝e̵̷̢̢̛͚̦̥̋̃̆̔̌̋̃͌͌̋͘ǩ̸̯̱ư̶̧̧̨̮̠̺̘̱͈̺̅̃̅͗́̋͝͝ơ̮̫̹͉̥̯̟͙̰͈͓͑͂̿͘͠͝͝ľ̷̶̵̨̧̖̯̺̈̀̆͊̑͑̕͜Ḇ̸̶̸̵̶̶̢̨̡͉̘̗̺̞͓͓̫͚̭̯̠̗͙͚̹̅̄̓̈́̈͌̆͑̂͌̎̃̌͌̑̾̋̃͌̔͒͗̽̿͒͝͝l̬̱͒ļ̺̤̫̔̃̍aen̨(Ljava/lang/Object;)I

    move-result v0

    :goto_0
    return v0

    :cond_0
    const v0, 0x0

    goto :goto_0
.end method

.method public static b(Ljava/lang/String;)Ljava/lang/String;
    .locals 55

    move-object/from16 v4, p0

    const/4 v0, 0x0

    invoke-static {v4, v0}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->k̸̷̸̶̸̸̘̻͈̱͚̱͎͎̟̘̜͎̤̤̗̹̭̏͑͋̂͌͋̀̅͗̈̀̄̌͊͌̎̈̿͒̓̅̋͘͜͝͝͝͝͝ͅKê̸̴̷̸̢̛̛̻̭̺̼͈̰̦̅̈́̿̑̈́̒̈͜͝c̢͓̘̤̑̅͠͝͝c̷̴̸̛̦̥͎̎͌ą̶̵̧̛̛̩̗̠͓͚̭̘̗͚̙̭̮̥̭̫̈́̂̏̂̑̌̆̌͊̋̑̃̋̚͘͜͝l̛̘͉̗̺̂̋͊́̈̍̔̈́̅͜͝a̶̪͉͉̗̯͌͌͌̎͑̈̈̌̈́͗̂̽̚͜a̸̛͉͗̅̅̋͂̈́͘̕͜e̷̵̛̬̰̗̭̹̦̩̯̤͇͗̃̌̃́̐͌͗͠cn͈̚e̸̢̨̯̹̘̝̺̰̯͓̘̠͓̯̗̹͎̫͎̭͂̓̾̎̃̑̚͘̚͜͝͠͝͝͝a̶̴̷̢̨̛̛̹͚̲̫̤̠̦̲̫̭̫̫̯͕̙͖̯͌́̈́̅̏͌̃̂̄̃͒͌̆͜͠͝͝͝͠h̥(Ljava/lang/Object;I)[B

    move-result-object v0

    new-instance v1, Ljava/lang/String;

    invoke-direct {v1, v0}, Ljava/lang/String;-><init>([B)V

    return-object v1
.end method

.method public static getDeviceLayout(Landroid/widget/FrameLayout;)I
    .locals 53

    move-object/from16 v2, p0

    invoke-static/range {}, Lcom/android/settings/kashi/Utils;->l̘͈̱̾̈̈n̊ö̡͎̼̺̭̯̥̻͚̥͉̯̦́̑͐̎̋̽̑̚ả͖̞̱̫̠̄̋͗͝͠ȟ͈e̥ḧ̛͓͈͉̫͉̗̱̮́̏̅͘͝ḧ̛̯̺̖̲͉͉͈̂̎̋͂̂͊̋̃͊̚͜͠o̷̵̸̡̢̭̹̦̠̹͌̃̂͊k̸͚͋͝c̗̻̥h̶̭̲̔̄K̶̨͙̠̫͙̜̺̫̱̔̊͐̄́̎͌̍̎͒̂͝͝͝K̨̺pk̯̎ö̧̧̭̲̑͐̄͒͗̅͜͝͝ț̈́̈́c̴̢̺̫̑̅͝Ķ̴̡̦̔̓̽̈̈͠ȃ͓̺̗̕K̶̭̥̯̰͉̺͗͌͌̎͂̔̔͗̑̄̓͆͠c̫̫̦͉̀u̶̻̩̮̼̍̈͜ḁ̧͂̑l̷̸̴̡̧̨̮̱̥͓̠̜͈̼̱̫̯͓͚͙̪͕͚̮̫̭͊̋̑͌͋̄̌́̈̀̌̏͗̆͐̄̃̂͗̆̂̚̕͝͝͝ļ̧̭̲̱̩̮̈͌͒̌̊͒̅()[S

    move-result-object v14

    const v17, 0x1abe1e

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->K̷̴̛̪̫̩̩̟͎̠̇̋̈̒͌͐͝K̨̖̺̙͕̃͌̂̆͋̌͘͘o̭͐͌̃̃k̿̋̽a̴̼̭̐̅̎̋̃̉̂͝ȁ̛̯͘l̴̶̢̧̢̜̭̤̭̺̦̥̱̐̄͗̌̃̋͑͒̈̄͝͝ṵ̸̶͌̎ō̸̠̩̈́͊̈̍p̸̫̙͝ĉ̘ų̛̭̫̬̺̤̹͎̖̔̍́̋̅̈́̈́̃̾͗͜ă̶͖͈͓̤̱̾̈̈́̔́̈̏̂̚P̖̋a̴͇̖̭͑ņ̸̧̢̛̜͚̝̠͚͇̱̙̖̞̺̫̜̝̦̫̎́̑̃̌́̅͐̿̒͒̅̚̕͜ç̸̺͎ü̶̘̫̺̯̟͊̀͝ḧ̡̪͉͈͎͓̱̿͗͋͊̂̌̚͜ơ̶̧̤͓̾̐̄͂̾a̷͈͋͘͝n̥̈́̐l̷̷͈̘̺̼̞͓̺̏̀̈́̔͌Kă̷̮̋̑l̷̸͙̮̫̺̈́̀̋͒͝͝ͅB̢̭̭̹̋͐̈́̏K̸̘͓̭͐̑͝()Ljava/lang/String;

    move-result-object v13

    invoke-static {v13}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v13

    xor-int v17, v17, v13

    const v15, 0x1ab2a8

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->n̛͚͓̥͂K̸̮ö̭̎ç̸̷̮̫̗̫̰̰̍̄̚͠ä̷̷̜̪̘͈̫̯͚́͋͊̋̋͊͑̋͜͜B̘̺̯̒o̶̧̧̠̘͉̫̙̘̹͇̊͂̆̋̅ȅ̴̥̭̗̙̠͚̫̮̺̗̘͚͎̦̠̅͋͗͌̉́̂͐͑̆͆͘͜ã̶̷̢̛̰̪̱̯̗̫̰̙̜͙̼̫̲̼̫̯̫̲͉̗͗̾͒̈̑͊̎̏̃́̈̉̈́͋̊͘͝͝Ķ̸̴̜͎͚̗̘̀̽͑̾̿̂͌̅̄͗̚k̷̫͎a̗̎̄͌͂̃̚ḩ̷̭̭͕̥̇̀̈͑̅̈̀̄P̱͙͇̮͈̋́͜Ķ̧͉̹̹̯̦̪̹̃̆̄̂̈́̄̃͝͠aã̵̸̷̭̰̭͉̯̬͚̱̲͚̪͓̮̲͎̱́͒̀̂̆̂̈̿̃͊̄͆͋̈͗́̏̓̿̚͜͜͝͝ͅa͓a̼͋̅̈̂͋̍͝ȃ̧̲̫̩͘u̠̲̫̞͎̠̅̎͑̌̾̎̈ŭ()Ljava/lang/String;

    move-result-object v13

    invoke-static {v13}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v13

    xor-int v15, v15, v13

    const v16, 0xdc5d

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper$2;->h̫̪̲̄͋̽͌̈́͗͋t̷̼̫̭̫̖͎̋̋̎͝͝K̶͈͈̜̩̀̈̋ķ̛͈̫̘͎̝̻͙̯͑̊̑̾͗͋̈̂̌̿̌̋͜Ǩ̪͈͝l̷͖̬͕̹̱̗̆̋̋̿̐̑͘͝K͌̂̋ä̧̛̫̯̮͓̯͓̙̮̯́̌͗̌̋̾̅͐͗̅̚͝ç̢͙̭̭̮̋̃͋́͜͝o̷̧̲̠͉̰̅̌͗̈̋̂͂ê̸̴̸̹̭̖̦͙͎̬̱̪̰̯͜͜͝a̷̵̘̦͎̭̱͚̯̩͌͋͐͗̂̚͜͝e̶̸̹͎̙͈̩̪̦͕̜̗͋̌͋͌̑̅͗͜͠͝ė̠̗̫͗͐͋͋ap͓̗̘̫̙͕͌̅͒̈́͌ã̵̗̑̑͠k̸̸͕̝̱̗̻͋̓́͑͂̌̚͝ľ̫̱ą̶̷̛͈͓͖̭̜̖̌̀̇̾͌̌̂͗͊̐͊͠K͓̦pP̵̷̸̸̸̧̢̧̮͕̙̹̠̰̫̠̩̙͑̀̑̋̅̄͌̿̎̅̚()Ljava/lang/String;

    move-result-object v13

    invoke-static {v13}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v13

    xor-int v16, v16, v13

    invoke-static/range {v14 .. v17}, Lcom/android/settings/kashi/Utils;->K̵̡̢̥͚̫̻͎̺̤̫̻̯̫̎̌͘͘͜͝͝͠n̶̬͕̈́̋͗p͘ļ̵̸̮̫̲͙̫̜̹̖̦̼͑́̑̌͐͑̋͗͝c̶̷̢̛͓͚͎͎̦͈̥͕̯̺̦̹͚̱̾͂̂̒̎̃͊̈̂͐̑͊̈́̇̄̈́͘̚͜͜͜͜͝͝ơ̡̤̦̲̲͈̱̱͚̹̘͎͕͙̂͗̅́̈́̏̌͝ā̷͓̩̭̤͎̪̲͈̠̙͓̭̟̘̮̱̌͑̉̑̃͋̎͑̈̌̋̎͌̃̎̂͆̈͑͋̄̑͊͑͗̌̃̌͌̈́̈́͋̚͜͜͝͠͠͝a̴̸̻͕̤̦͗̑̑͝͝n͈k̶̴̴̨̡̛̺̱̯̯͉̗̘̥͈͙̹̦͎̯̮͊̊̄͗̃͐̊̈̈́̈̈̈́̃͑̊̑̚͘ḩ̸̴̴̛̟͇̠̫̹̩̪̘̗̭̯̅͑̈̂͑̈́͂͊̚͜͝͝ȩ̸̸̧̧̧̢̪͉̮̗͚̱̺̙͖̬̫̍̂̅͂̎͂̃̅̔́͜͠͝͝ͅȁt(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v14

    move-object/from16 v0, v14

    invoke-static {v2}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->ca̵͖̺͈̲̖̖̽̋͑u̵͙̯̬̫̪̮͎͎͖͋̇̂̃̐͌̿̋̎͋̈́̋̚͝͠Ķ̶̧̛̛̛̲̰͉̙̫͓̭͓̂̎̂̿͊̇͌͌̃̃̅͊̋̍̾̅̎͌̌͌̀̂́̿̌͜p̵̶̶̨̧̢̛̛͙͙͚͉̗̘͚̮̟͙͉͌̐̿͑̔̎͊̈́͋̈͘̚͜͜͜͜͜ǒ̷̸̯̫̩̘̠͗̂̋̈́̋̚͜ū̸̷̸̸̸̢̢͙͎̭͈͕̥̘̗͕͓͗͂̿̂̂̅̈͊̋̍̈́̎̑̌͝͝K̸̷̢̧̧̮̜̗̭̮͚͚̫̰̾͗̆͌ą̸̷̴̸̵̸̧̢̨͚̖̭̯͙̻̱̭̪̼̱̹͎͚̖̗̩̹̺̦͙̗̥̲̯̥̮͕͈̃͌͗̾̅͒̾̏̀̾̂̅̏̂̅̍͐̔̀̌̈́̚͝͝k̫̻͗̎ų̷̶̢͙̮̲͕̼̹̗͉̜͙̤̥̥̂̿̑̅̈̌͐̃͋̑̐̾̋̈̒̄͒͌͘͜͜͠͠p͈ẖ(Ljava/lang/Object;)Landroid/content/Context;

    move-result-object v1

    invoke-static {v0, v1}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->K̶̨̫̘̞̖̲̻͚͉̂̀̄̚e̸̴̢̧͓̗̠͚̫̗̖̫̋̅̌̈̍̎̈͐̉͜͜͜͜͝ţ̧͎͓͕̠͈̈̽̾̑͒̔̈̍͆̅̈́̔͂͐̈̔̒͝õ̸̤͎͐͋a̟̪͚͎͓̼̭̖̍̄u͑͒ķ̧̹̩̥̥̥̌̌̂͋̈́̃̈́̚͜l̷̸̛̲̮̺̗̯̰̦͕̈́͋́̑̋͑̈́̽̿̀͋̕͠͝͝ą͎̘̯̂̎́͋̀͗̋̒͝eK̾͂̍̎̈́͜à̴̪̺͓͎̥͚̪̻̑̅̈́̋̒a̴̴̛̫̯̥̙͋̀̈́͗̿h̵P̸̢̛̩̼̫̱̬̹̙̫̩̱͚͙̰͋̌͌͋̏̾̈́̋̎̑͗̽̚̚͜ä̦̭̝́̎ȃ̵̵̸̸̧̧̧̧̻̩͈̩̼̮̭͓̭̲̦̦̰̹̫͎̘͎̠̲̖̦̗̖̬̦͈̪̭̝̋̃̈́̄̑̄̌̂̿̐̋̑͑͊͑͋͐́̎͋̿̅̃̍̑̌̆̚̚͘̚͘͜͝͝(Ljava/lang/Object;Ljava/lang/Object;)I

    move-result v0

    return v0
.end method

.method public static getDeviceName()Ljava/lang/String;
    .locals 53

    invoke-static {}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->o̴̠̺ư̸̵̴̧̧̧̧̫̹͕͈͎̮̻̭̫̘̭͉̹͚̺̜͗̌͐̃̌̈́̀͊̽̊̄̈́̿̂̎̃͘͠͝͠P̷̧͈̮̦̭͚̦̈́̿̂̑̈́̑͘͜͜ͅn̷̢̫͉o̶̗͚ö̯́̐͘͜͝ţ̷͙̭͉̪̭̥͕͈͚̞̋̎̈͌̂̂͌͑͂͜͜͝aṷ̷̶̗͎B̸̙͚̔̈ḧ̗́ḩ̷̸̸̴̨̡̧̟̱͉͉̻͓͚̠͎̮̺̫̹̥̗̗̭̑̽́̋̍͑̋̄̀̏̇͌̿͗͑͘̚͝͠͠h̸̵̥̫͈͚̫̼̬̒͌͑̃͒̋͑̋̈́͗̃̈̈́̅͝͝͝c̸͓̐h̨̛̯̻̹̽̌̋͜Ķ̷̴̯̗͉͌̈́̿͗̄̋̈́͘͘͘ã̷̸̵̛̛͙̻̺̱̩̗̯̆̑͌̑͌̋͜͜͜͠͝͝a̙̫̍p͕̅̄c̫u̸͉̺̰͈̭̎͌͜͝n̵̷̶̡̦̱̗̪̦̄̆̋̅͌̇͗͘͝eâ̑()Ljava/lang/String;

    move-result-object v0

    invoke-static/range {}, Lcom/android/settings/kashi/Utils;->l̘͈̱̾̈̈n̊ö̡͎̼̺̭̯̥̻͚̥͉̯̦́̑͐̎̋̽̑̚ả͖̞̱̫̠̄̋͗͝͠ȟ͈e̥ḧ̛͓͈͉̫͉̗̱̮́̏̅͘͝ḧ̛̯̺̖̲͉͉͈̂̎̋͂̂͊̋̃͊̚͜͠o̷̵̸̡̢̭̹̦̠̹͌̃̂͊k̸͚͋͝c̗̻̥h̶̭̲̔̄K̶̨͙̠̫͙̜̺̫̱̔̊͐̄́̎͌̍̎͒̂͝͝͝K̨̺pk̯̎ö̧̧̭̲̑͐̄͒͗̅͜͝͝ț̈́̈́c̴̢̺̫̑̅͝Ķ̴̡̦̔̓̽̈̈͠ȃ͓̺̗̕K̶̭̥̯̰͉̺͗͌͌̎͂̔̔͗̑̄̓͆͠c̫̫̦͉̀u̶̻̩̮̼̍̈͜ḁ̧͂̑l̷̸̴̡̧̨̮̱̥͓̠̜͈̼̱̫̯͓͚͙̪͕͚̮̫̭͊̋̑͌͋̄̌́̈̀̌̏͗̆͐̄̃̂͗̆̂̚̕͝͝͝ļ̧̭̲̱̩̮̈͌͒̌̊͒̅()[S

    move-result-object v36

    const v39, 0x1ab6ec

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper;->ku̥͖̠a̴̸̢͓̋ͅn̚ķ̨̛̯̹̆͗̋͝l̴̨̛̮̮͈̭͑̈a̷̢̢̱̰̹͎̿̾̈́͐ç̵̸̸̸̴̴̴̧̧̛̫̲̰͎̫͓͈̱̗̍̂̋̈̋̋̋̀̌̂̃̂̔̿̑̍̃̂͒̚͜͜͝ͅBą̶̶̢̛̥̤̘̤̱͓̥͕͋̎͆̈́́̋̈́̋͌͜͜B̤́̆͜͝h̆ù̓̎̾Ķ̸͈͚̺̥͋̄͌̆̂͂̌͆̕ͅc̸̛̗͕̰̫̘̪̫̆̋͗͠͠a̷̶̠͈̥̮̠̾͌́͌̌̒͋͜͝a̶̷̫͓̮̩͘͜P̷̛͎͑̌́̌͝͠a̸ô̷̴̸͕̑Ķ̌ų̶̧̧̢̢̛̠̰͓̠͓̥͎̺͉̦̠̬̩͓͉̖͈̟̌͂̿͋̑̌̌́͂͊̍̂̔͗̈́̃͋̋̉̿͋̑̂́̚͜͜͝͝B̡̛̻̗̯̺̰͒̀̈́͝ȯ̻̦͈̱̥̩̺̹̭̑͆͋̌͂͘͜͜͜͜͠()Ljava/lang/String;

    move-result-object v35

    invoke-static/range {v35 .. v35}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v35

    xor-int v39, v39, v35

    const v37, 0x1aaf1c

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper;->a̮̠̘̦̍̂̎̍́̎̆̃͝p̮͇̊ä̴̧̬̲͓̩̗́̔̿̎͑̌̆̋͘t̴̸̨̹̖͕̺̘̋̉̅̾͒̌͋̾̎̌͘͝p͓̑ơ̴̠̮̪̪͈͖̿̍̑̆͝p͓͓͂͝a̶̸̷̢̧̠͉̲̯͎̘͚̪̟̤͇͒̄͒̀̌̈̈́͌̑͑͝͝ͅB̴̧̗͇͖̩͎͌͐͊̃͆͌̅̂͌͜p̸̴̧̭̙̼̯̹̘̺̗͈̩͎̦̘̉́͑̋̃̌̑̍̑̑̾̅͂̍̂͊͗̅͗̾͠ͅa̸̢̨̧̛̺̻̦̹͎̫͎͈͈͎͙̫̫̞̞̰̮̠͐͂̌͗̂̂͐́̄̿́̋̍́̂͌͆̐̀͗̑̇̚͘͜͜͠͝Ķ̷̢̛̯̠̮̞̥̭̫̫̬͈̗̘̭̭͉͊͌̂͊̔̑́̂̑̌̄͘͘͜͜͜K͕̫̀͌ö̘̘̝́̍̾͌̑͗K͌͝o̸̙͈͐̈̃͗̾̌́̉ţ̥̄̈́͗͗l̸̫̠̄͐̾̈́͑͜()Ljava/lang/String;

    move-result-object v35

    invoke-static/range {v35 .. v35}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v35

    xor-int v37, v37, v35

    const v38, 0x1aabb8

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->h͚̀̚a̵̻͒̆ȇ̷̦̯k̫̈a̸̸̧̧̦͎͙͈͇͚̫̻̫͕͌̈̂̈́͗͒̽͜͝͝͝ͅa̸̷͒ļ̶̡̪͎͎̻̈́͋̽͂́̾̓̾́͐͗̅̏͌̊̅́͐B̸̨̡̖͎͓̰̩̦̯́̈́̂̃͝K̸̗̥̫̘̏̈͂̏̑̍͝K̘̺̻͑͂͆̄͗̎̑̈́͠o̷̸͎̲̗̩͚͐̂̏̎̅͗͂̑͘͝ô̴̶̷̢͓̩̗̼͈̫̫̇̋̽͋̌͊͗͑̈́̚͜͝͝uP̷̺̖̙̫̘̻̯̫̜̙͋̃̎̂͌͜͝ơ̛͎̱̝̥͓͙̥̲͑͊̂̔ţ̴̸̛͈̬̫͚̩̻̮̲̗͑̎̌̿̂͐̀̊̈̋̈́͒̑̿̾͌͘͜͜͜͝͠B̶̸̧̛͇͉͉̩͚̮̑̌͐̌͋̌͌̚͘͝ͅp̌́͜na̺͉̿p̷̴̢̧̛̭̦̭̱̭̭͇͚͕̫̮͓̃̑̈́̃͋͆̃̆̈́͋̈͌͌͘͘͜͝č͊()Ljava/lang/String;

    move-result-object v35

    invoke-static/range {v35 .. v35}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v35

    xor-int v38, v38, v35

    invoke-static/range {v36 .. v39}, Lcom/android/settings/kashi/Utils;->a̰ķ̶̶̶̷̸̷̸̧̛̛̖̺̠̪͈̫̤̘̹̗͙̫͈̯̫̺̰͓̫̘̗̤̮̫͙͚̖̅̀̽͗̀̈́̂̿̈́̋̄͐̈́͗̽̈́̆̂͗̋̏̇͗̈̚͘̚͜͝͠͠͝͝͝͝͝͝ͅnă͎͕͈̋̅͘͝e̢͎̯̭̫̒̂ǹ̤̭̗̰̏̄͜ͅȩ̧̡̘̜͆̉̾̈́́̈́̋̅ť̛͙̺̜̠l̂P̢̍â̶̶̴̻̯̭͓̥̫̹̫͚̮̹͕̪̫̱̽̃̎͑̓̀̃̐͝͝͝c̭̓̀͌̿͝͝ţ̵̡̫̖̪̺̰͚͎̱̮̬̐̈̈̃͌͑̌͠͝õ̫̺͉̯̃̔̎̈̑̃̃͜ao̵̷̫̘̖̯̐̑̔͜͝e̸̲̗̥̮̠̿̋́̕͠ŭ̴̷͚̘̘͎͂̌͐̋̌͋̌̍̑͋͠å̶̢̱͚̥͈͉͖͗̿̋̀̋͌͘̚͜o̷̴̸̗̞̫̞̬̟͎͎̰̫͋́̈͗̾̄͌̂͒͌̇͌̄͠(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v36

    move-object/from16 v1, v36

    invoke-static {v0, v1}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->ļ̶̼̗͓̌̑aṵ̢̠̫̥̅̋̌̋̍̍̑͜ö͉͌ǘ̚ơ̧̢̺̹͉̺͚̗̦̯͕̂̄͋͒̀̂̅̋̏̂̾͠͠a̴̡̦̫͎̩̫͚̯͗͗̈́͠B̶̶̰̫̞̫͎̿͌͌̒ủ̶̻̰̂͑͠p͎̻̜͒͐̄̚͜͝͝k̨̥͓̼̿̎̕K̝̪̪̖̫̿͆̓K͋l̞̺̑p̶̴̸̧̡̨͈̝͈̖̞̺̥͕̙͙̎͒̋̎̎͌͗̂̾͗͐̅͂͌̿́̑͠͝͠͝ķ̤̺͉̦̋̈́͜͝a̶̵̢̢̫̯͎͈̫̜̗̘̗̻̰̗͈̥͖̹͈̖͉̗̦̗̘͚̼̘̤͒̓̎͆̾̃̃̔̋̊͑͌͑͑̿̑̍̈͋̚̚͜͜͝B̸̶̶͚͎̫̫̘͈̮̝̌̎̓͗̂̈́͌̌́ḩ̷̵̶̷̸̧̛̛̭̪̭̫̭̥̻̺̭̤̋͌̎̿͗̑͒̂̌͌͗͋͜ô̬̖̅B̷̧̤̘̄͊̾̋͒̈̾͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/String;

    move-result-object v0

    return-object v0
.end method

.method public static getResIdentifier(Ljava/lang/String;Landroid/content/Context;)I
    .locals 55

    move-object/from16 v5, p1

    move-object/from16 v4, p0

    invoke-static {v5}, Lcom/kashi/settings/view/AboutSettingsHelper$2;->õ̻ȁ̗̫̖͉̬̦̬̱͕̎͌̈́̑̌̌͑̃͜͝n̘̥͗̈ṵ̸̢̠̦̭͙̎̐̎̓͜e͚̙̯ĺ̴̷̷̲͈̙̥̼͉̥̙̂̋̾̈́̀̌̉͋B͕̙̄͌̋͌̓̃͘h̶̴̷̨̧̛͉͓̻͈̫̘͖͈̫̱̖̲̙̯̏̀̀͆̍̂̌͌̌̽̔̍̌̾͋͜͝͝͝B̧̥̋̈́̈n̸̗̜͇̦̱͙̞̭̞͑̐͋͜c̴̷̸̷̶̸̸̨̨̢̭̮̩͓̪͈͓͚̭̺͉̱̮͚͌̋̈̏̇͌̈̈̾̀̾̂̿͐̅̈́̈́̈͌͂̊͑͘̚ͅc̨̢̫͕̤̟̫͈͎̫͚̫͎͋͆̂̅̌͒̔̈͌́̋̒̔̚͠ͅn͈͉p̷̧̪̜̯̤̹̤̭̿͌̌͗̔̈́͆̈̃̈͌͌͘̕͝p̷̯̗̘̽͊͗͠ţ̶̯̱͎͓̦̫͌͋̈́͑̉̚̕͠k̴̸̷̴̦͉̫͓̂͑̍̊͘ͅu̶̬̻͚͎͒͋̑͋̋̃͝(Ljava/lang/Object;)Ljava/lang/String;

    move-result-object v1

    invoke-static {v5}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->h̢͎̻̦̪̼̓͑͗ó̴̴̴̸̧̨̹̩̥̭̪̫͂̔͘͝͝k̫̤̖̺̤͗̃̔̃͋͠͝͝͝á͓́͝ȩ͐͐ļ̶̶̸̲̰͈͕̻̟͓̟̭̏͑͒̑͗͒́̿̒͜͝͝K̵̴̛̝͚̭͕̺͈̱̹̭̪͇͓͆̅̍͋̃͋̈̈́͗͂͒̎̋̿͘͘͜͜͜K̷̴̨̯̹̺͑̿̋̅͋́p̴̫̲̂͠͝t̥̃͌lḩ̴̀͆̄ä́o̶̥͉̍͌̈̉p̗̭͇ĥ̸̷̨̰̜͖̻̫̘̦͓̘͕̏̍̈́͐̋e̢̧̛͕͕̘̲̹̮̙̎̈̎͑̈̒̕͜B̸̶̸̷̶̧̩̦̻̩̺̥̪̹̗̟̟̗͈͂̏̍͂̋̃̌̿̀̑̀̋͒̎̎͘͘͘̚͜͝c̶̸̶̛̛̪̫̤̘͚͓̫̺͚̗̙̼͚͓͈̝͉͌̿̽͋̄̋̿͗̎͊̔͜͜ͅpu̸̱̫̅̃ŏ̴̢̦̼͉͑͗̈́̉͗̋͌̂͝͝(Ljava/lang/Object;)Landroid/content/res/Resources;

    move-result-object v0

    const/4 v2, 0x0

    invoke-static {v0, v4, v2, v1}, Lcom/kashi/settings/view/AboutSettingsHelper$2;->Ķ̷͙̦̼̲̱̭̃́͑̈̈́̆̔̈c̶̷͉͉͈̻͉̦͉̟̱͕̅̋͗͋͗͐̀̍̾̅̑͘͘͜͜ņ̶̦̭̗̠͕̞̺͎̱̱̂̾̑̂́͒̀̐͘ͅK̶̸̝̤̱̥̦̘͎͗͑̃̓͜t̸̶̸̡̖̹̺̗̬̯̫̗̠̺͓̫̱͗̂̈̀͋̈́̊͑̃̾̋̎̋̌̂̌͑̀̎͘͝͝͝u͝͠p̴̸̢͕͈̭̪̼͋͋̌͗ą̃̈͜t̮̺ǎ̶̰͋͌̂͗̌P̘͎̎k̅u̱̟̗̗̭̘̮̦͉̜̹͈̭̫̭͌̅́͂͌̂͊̏̾̀̐̚͜͠c̸̶̢̗̱̩̮̝͖̔͗̈̌͋̈̒́̏̅͘͝ͅň̡̛̄͗̀̋l̪̭̙̠̦̞͓̬͌̋̋̄͜a̸̸̘̼̫̍̀͒̈̌͜ͅȟ̶͖̫̻͗͜ͅt̵̴̴̢̢̬̱̻̗͚͕͚͎͈͈̦̥̺͙̼́̾̈́̍͒̾̃̏̌͘͘͝͝͝ă̵̸̻(Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;)I

    move-result v0

    return v0
.end method

.method public static getStorageLayout(Landroid/widget/FrameLayout;)I
    .locals 53

    move-object/from16 v2, p0

    invoke-static/range {}, Lcom/android/settings/kashi/Utils;->l̘͈̱̾̈̈n̊ö̡͎̼̺̭̯̥̻͚̥͉̯̦́̑͐̎̋̽̑̚ả͖̞̱̫̠̄̋͗͝͠ȟ͈e̥ḧ̛͓͈͉̫͉̗̱̮́̏̅͘͝ḧ̛̯̺̖̲͉͉͈̂̎̋͂̂͊̋̃͊̚͜͠o̷̵̸̡̢̭̹̦̠̹͌̃̂͊k̸͚͋͝c̗̻̥h̶̭̲̔̄K̶̨͙̠̫͙̜̺̫̱̔̊͐̄́̎͌̍̎͒̂͝͝͝K̨̺pk̯̎ö̧̧̭̲̑͐̄͒͗̅͜͝͝ț̈́̈́c̴̢̺̫̑̅͝Ķ̴̡̦̔̓̽̈̈͠ȃ͓̺̗̕K̶̭̥̯̰͉̺͗͌͌̎͂̔̔͗̑̄̓͆͠c̫̫̦͉̀u̶̻̩̮̼̍̈͜ḁ̧͂̑l̷̸̴̡̧̨̮̱̥͓̠̜͈̼̱̫̯͓͚͙̪͕͚̮̫̭͊̋̑͌͋̄̌́̈̀̌̏͗̆͐̄̃̂͗̆̂̚̕͝͝͝ļ̧̭̲̱̩̮̈͌͒̌̊͒̅()[S

    move-result-object v16

    const v19, 0x1ab87a

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper;->ḩ̷̵̴̩̲̝̺̗̠̃͌͘͠c̷̺̫̦̠̈͝c̺h͒̑B̯͓̗͆̂̎̋h̵̸̡̹͕̭̟͉̤̎̒́͐͐̂̄͝à̭̲̯͎͉͝c̲̗͆̂̃̈͝a̸̶̴̸̢̢̢̘̫͎̗̖̥̥͕̻̻̭̹̋̋͌̓̄̃̎̂̍̈̈́̈́̌̎̿̈́̓̕̚͘͜͜͠͠͠a̸̙u̸̫̩̞͌̿͂̈͜c͉̘͈̀͂̈́̂̋̃̈́͘ơ̧̤͓̜̯͓̥̱͓̌͌̈̃̿̈͜͠k̨̯̖͋́͘à͉̫̋̾͜Ba̸̵̧̛̫̗̠̙͚͂̃̅̈̕͘͝ç̵̵̴̷̸̷̴͓͇̙̗̫̹̹̱̜͚͈͙͚̫͊̋̈̊̂͐͌̅̔̅͋̃̋̾̐̔̋̔͐̂̃̈͊͘͠͝͝͠ą̸̷̵̵̶̵̢̛͎̱͖̹̫̠̺̦̹̬͕̺̥̾͋̅̋̎̎͌̋͋̌̌̂̌̀̅͑͗͌̈́͌̽̃͝͝͝͝ķ̸̙̱̫̑a()Ljava/lang/String;

    move-result-object v15

    invoke-static {v15}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v15

    xor-int v19, v19, v15

    const v17, 0x1ac56d

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper$2;->ķ̵̶̶̧̙̩͕̹̱͚̲̟̯͚͑̈͌̏͌́̋͒͌͌̆̋̎̐͘͝o̖̺̫͉͕͋o͗͘p̴̸̵̸̷̷̘̥͈̖͚̗̰͎̘̮̪͗̽͂̄̀͗̋͊̂̋͘̚͜͠ţ̶̶̷͙͕͈͖̗̗͙̮̰̰̮̠̲͚̯͈͚͈̫̈̂̔͊͑̋͗͐̆͒̂̌̈̿̒̈́̍̌́͂́͘̚͘͜͜͜͝͝ņ̴̷̸̛̟͕͙͓̥̈́̋̋̃̃̃̂̅̌̋͝͝c̛̥̭̗̥͙̎̊͗͌̇̚͜ha̧̘̯͉l̵̫̗̭̈̂̌̎ņ̴̷̴̸̶̢̧̙̻̤̯̼͉̯̦͉̲̯̭̦̫̘͋͗̃̄͋̎͌̾͌͋́̋̾͌̃̌͘͝͝͝ͅą̛͕̖͈̥̺̋̃̀̋̀̑͐͋́͝͝ḉ̻̪̒̚͠ať͈̫̤̹͋̃́̚͝ͅaư̶̸̴̸͈͕̩̹̫̻͓̥͓͗͑̍̂̐͌̿̈́͒̅̅̂̑́̉̋̔̍͜͜()Ljava/lang/String;

    move-result-object v15

    invoke-static {v15}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v15

    xor-int v17, v17, v15

    const v18, 0x1abe37

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper$2;->p̵̡̭͠ǫ̴̸̸̦̦̭̠͒̓̎͜͠Ką̦̆͋t̹͈̖̫̤̦̾̋͑̈́͜n̷̸̸̢̛̗̪̥̘̺̱̟̆̄̀̋̈̅̑͋̈̃͑̏͜͜͝͝K̶̺̦̫̫̼̦̄̃͐͂̈́̿̑̋͗̈́͘͝͠͝͝o̎̚ŭ̸̸̷͉̮̾̀̀ū̸̶̱͚͈͉̗̫̫̒͗͗̈́̀̂̏̏̋̂̅̕ơ̴̵̢̢͈̲̗̙̭̫͎̪͉̯͚̘̌̅́̅̈̿̈́̂̎̽͒̌̕̚͝͝͝ca̸̷̷̘͈̯̹̖͚͎̻̫̟̥̋͑͌͊̽̿͘͘͝P̛̭̯̰͈̆͠ţ̸̴̱̯͖̟̦̏̌͋̐͗͜͠l̴̸̡̥̮͓̠̭͓͚̲͓̮͉̫̤̱̮̘͈̦̭̭̖̺͗̈̅͂̈́͗̒̈́̾́̋͑̿̌̋̿̋̾̋̈̑͐̂̄̚͜͜͠͝͠͠͠͝hü̫̃̈̚ķ̷̷͙̖̠̦̪̦̦̫͓̤̂̀̃̌̈́̽͑͜͝a̷()Ljava/lang/String;

    move-result-object v15

    invoke-static {v15}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v15

    xor-int v18, v18, v15

    invoke-static/range {v16 .. v19}, Lcom/android/settings/kashi/Utils;->K̵̡̢̥͚̫̻͎̺̤̫̻̯̫̎̌͘͘͜͝͝͠n̶̬͕̈́̋͗p͘ļ̵̸̮̫̲͙̫̜̹̖̦̼͑́̑̌͐͑̋͗͝c̶̷̢̛͓͚͎͎̦͈̥͕̯̺̦̹͚̱̾͂̂̒̎̃͊̈̂͐̑͊̈́̇̄̈́͘̚͜͜͜͜͝͝ơ̡̤̦̲̲͈̱̱͚̹̘͎͕͙̂͗̅́̈́̏̌͝ā̷͓̩̭̤͎̪̲͈̠̙͓̭̟̘̮̱̌͑̉̑̃͋̎͑̈̌̋̎͌̃̎̂͆̈͑͋̄̑͊͑͗̌̃̌͌̈́̈́͋̚͜͜͝͠͠͝a̴̸̻͕̤̦͗̑̑͝͝n͈k̶̴̴̨̡̛̺̱̯̯͉̗̘̥͈͙̹̦͎̯̮͊̊̄͗̃͐̊̈̈́̈̈̈́̃͑̊̑̚͘ḩ̸̴̴̛̟͇̠̫̹̩̪̘̗̭̯̅͑̈̂͑̈́͂͊̚͜͝͝ȩ̸̸̧̧̧̢̪͉̮̗͚̱̺̙͖̬̫̍̂̅͂̎͂̃̅̔́͜͠͝͝ͅȁt(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v16

    move-object/from16 v0, v16

    invoke-static {v2}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->ca̵͖̺͈̲̖̖̽̋͑u̵͙̯̬̫̪̮͎͎͖͋̇̂̃̐͌̿̋̎͋̈́̋̚͝͠Ķ̶̧̛̛̛̲̰͉̙̫͓̭͓̂̎̂̿͊̇͌͌̃̃̅͊̋̍̾̅̎͌̌͌̀̂́̿̌͜p̵̶̶̨̧̢̛̛͙͙͚͉̗̘͚̮̟͙͉͌̐̿͑̔̎͊̈́͋̈͘̚͜͜͜͜͜ǒ̷̸̯̫̩̘̠͗̂̋̈́̋̚͜ū̸̷̸̸̸̢̢͙͎̭͈͕̥̘̗͕͓͗͂̿̂̂̅̈͊̋̍̈́̎̑̌͝͝K̸̷̢̧̧̮̜̗̭̮͚͚̫̰̾͗̆͌ą̸̷̴̸̵̸̧̢̨͚̖̭̯͙̻̱̭̪̼̱̹͎͚̖̗̩̹̺̦͙̗̥̲̯̥̮͕͈̃͌͗̾̅͒̾̏̀̾̂̅̏̂̅̍͐̔̀̌̈́̚͝͝k̫̻͗̎ų̷̶̢͙̮̲͕̼̹̗͉̜͙̤̥̥̂̿̑̅̈̌͐̃͋̑̐̾̋̈̒̄͒͌͘͜͜͠͠p͈ẖ(Ljava/lang/Object;)Landroid/content/Context;

    move-result-object v1

    invoke-static {v0, v1}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->K̶̨̫̘̞̖̲̻͚͉̂̀̄̚e̸̴̢̧͓̗̠͚̫̗̖̫̋̅̌̈̍̎̈͐̉͜͜͜͜͝ţ̧͎͓͕̠͈̈̽̾̑͒̔̈̍͆̅̈́̔͂͐̈̔̒͝õ̸̤͎͐͋a̟̪͚͎͓̼̭̖̍̄u͑͒ķ̧̹̩̥̥̥̌̌̂͋̈́̃̈́̚͜l̷̸̛̲̮̺̗̯̰̦͕̈́͋́̑̋͑̈́̽̿̀͋̕͠͝͝ą͎̘̯̂̎́͋̀͗̋̒͝eK̾͂̍̎̈́͜à̴̪̺͓͎̥͚̪̻̑̅̈́̋̒a̴̴̛̫̯̥̙͋̀̈́͗̿h̵P̸̢̛̩̼̫̱̬̹̙̫̩̱͚͙̰͋̌͌͋̏̾̈́̋̎̑͗̽̚̚͜ä̦̭̝́̎ȃ̵̵̸̸̧̧̧̧̻̩͈̩̼̮̭͓̭̲̦̦̰̹̫͎̘͎̠̲̖̦̗̖̬̦͈̪̭̝̋̃̈́̄̑̄̌̂̿̐̋̑͑͊͑͋͐́̎͋̿̅̃̍̑̌̆̚̚͘̚͘͜͝͝(Ljava/lang/Object;Ljava/lang/Object;)I

    move-result v0

    return v0
.end method

.method public static h̼̹̘̹̬͗̂̌̈́̈̃â̶̸̙̺̲̹̌̏̂̌̈̐͝͠o̷̵̷̸̦̎̂̑̆̍͠͠͠c͙͜ơ͇͎̪͓̪̫̦̈́̆̈́̏̑Kc͚̾P̧̯̘̫͋̂̏͝ǎ̷̧̛̯̯̦̲̺̯͈͉̹͚̺̱͗͗̎͗̔̓̈́̂͝͝p̸̶̶̨̟͉̼̖͖̩̹̺̲̥̫̊̽͑̆̄̆͗̋͜͠͝͝o͌ê̷̸̢̢͎̹͈̫̮̮͈̹̙̘̥̱̑̏͂͌̂̑̌̔͐̿͝c̛̲̝̠͎̝̑̈̅̋͝ḁ̸̛̟̲͊̂͑́̈́͊̃̈̾͘͜͝͝ņ̸̸̸͙̝͈̮͓̻̮̼͖̪̱̐̀͗̌͊̈́̑͂͘p͕̜̘̾̉̂̋̓͠eKB̸̷̶͚̯͈͚̫̱̫͌̃̾͝oK̛͓͙͈n̗̤̜̺̈́͘ȟ̸̷̵̸̶̴̛̭͖̯̘̫̮͉̭̫̗̑̌̃̌̾̐͂͑̔̌͌̚͘͜͝ͅͅͅn͝P͓K̘̖̟͗(Ljava/lang/Object;III)Ljava/lang/String;
    .locals 1

    invoke-static {}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->ţ̴̶̹̖͉̭̔̂͌̈̑͒͐̚͘͝Ḃ̸̛̪̮̜̖̖͗̋̍̽̀̎̑͌͘ͅu͚͐̈̃ư̶͈̙̥͎̭͓͇̹̫̮͉͚̍̆̌͌͗̿̈́̈͗̀̾́̉͌͋͋͜e̸̷̸̢̢̘̙͎̩̦̭͕͕͕͑̑̀̂̔̀̃̎̚ě̶̮̗̝̗͈̓̃̈́̂̀̈͌̔͌̌͋͝ţ̸̵̸͈͎̱̫̝̦̹͎͇͎̱̲̫̼̱̹̘͓̲͈̋̐̿͋̃͌̈́͂̃̏̌̇̿̓̿͋̋͋̋̃͋̑͘̚͜ͅţ̴̢̗͎̯̩̰͌̽͒͐͑͌ö̸̯̘̗́͂̆͋͒̌a̛̖͓̋͂̏̈́̑̍̈́̌͜͜͝K̋̆ơ̴̪̝͉̿̉͗͂̂̂̈́͘͝B̥̹̺͕͈̿̏̔͋̆͘͝ö̵̞̹̺̺̼̖̫̖͕͈̙̽̂̌̃̃͑͘͜͝l̀ő̶͓̲̀ǒ̜̥͓͈̈́͌h̢̢̙̑͜t̪̲͓͖̑̃̕a͗u̹̗͝()I

    move-result v0

    if-gez v0, :cond_0

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/kashi/settings/view/AboutSettingsHelper$2;->ȩ̢̦͕̪̹̤̙̭͎͚̹͎̗̰̗̾̔̒̃́̂͗̑̎͋̈́̅̈̃͘͠k̸̫͎̘̲̓̍͘ứ̴̧̨̛̺̺̻͓͉̠͓͉͚̮̈͋͑͌̈͒͋͘̕̕͜͠ô̴̸̢̧̩̜̮͙̻͎̱̺̯̹̬̆̎̓̿̔̌͊̃̂̔̚̚͜͠͠͠ͅĶ̸̫̲ĉ̷̴̗̃̑k̋ļ̴̷̸̸̵̴̛̲̫̟͚̗̜̩̫̙̠͓̭̪̭̹̰̰̙̲̮̮̲̭̦̖͉̭̻̯̂͗̊̏̑̂̋̾̆͋͆̃̿̋͌͌͠͝͝h̡P̜̮͗͊̀̎̑̾h̶̸̶̶̴̴̵̷̷̶̸̨̢̧̛̝͎̮̭̝̱̖̖̙̯̘̺̺͎̯͓̹̲̦̗̫̬̫̺͓̹̎̒̏̑͋͗͌̆͌͋̌̿̔̾͌̃̒̅̎͌̌̀͌͌̌͘̕͘̕͘͝͝͝͝͠k̩͓͚̪͚̗̭̖͕̈͑͌̿̾̈̂PP̶̶̛̯̺̺̮̥̐̄̅̄͑̈͌̀͜([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_0
    return-object v0

    :cond_0
    const v0, 0x0

    goto :goto_0
.end method

.method public static isNightMode(Landroid/content/Context;)Z
    .locals 52

    move-object/from16 v1, p0

    invoke-static {v1}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->h̢͎̻̦̪̼̓͑͗ó̴̴̴̸̧̨̹̩̥̭̪̫͂̔͘͝͝k̫̤̖̺̤͗̃̔̃͋͠͝͝͝á͓́͝ȩ͐͐ļ̶̶̸̲̰͈͕̻̟͓̟̭̏͑͒̑͗͒́̿̒͜͝͝K̵̴̛̝͚̭͕̺͈̱̹̭̪͇͓͆̅̍͋̃͋̈̈́͗͂͒̎̋̿͘͘͜͜͜K̷̴̨̯̹̺͑̿̋̅͋́p̴̫̲̂͠͝t̥̃͌lḩ̴̀͆̄ä́o̶̥͉̍͌̈̉p̗̭͇ĥ̸̷̨̰̜͖̻̫̘̦͓̘͕̏̍̈́͐̋e̢̧̛͕͕̘̲̹̮̙̎̈̎͑̈̒̕͜B̸̶̸̷̶̧̩̦̻̩̺̥̪̹̗̟̟̗͈͂̏̍͂̋̃̌̿̀̑̀̋͒̎̎͘͘͘̚͜͝c̶̸̶̛̛̪̫̤̘͚͓̫̺͚̗̙̼͚͓͈̝͉͌̿̽͋̄̋̿͗̎͊̔͜͜ͅpu̸̱̫̅̃ŏ̴̢̦̼͉͑͗̈́̉͗̋͌̂͝͝(Ljava/lang/Object;)Landroid/content/res/Resources;

    move-result-object v1

    invoke-static {v1}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->k̸̷̸̶̸̸̘̻͈̱͚̱͎͎̟̘̜͎̤̤̗̹̭̏͑͋̂͌͋̀̅͗̈̀̄̌͊͌̎̈̿͒̓̅̋͘͜͝͝͝͝͝ͅKê̸̴̷̸̢̛̛̻̭̺̼͈̰̦̅̈́̿̑̈́̒̈͜͝c̢͓̘̤̑̅͠͝͝c̷̴̸̛̦̥͎̎͌ą̶̵̧̛̛̩̗̠͓͚̭̘̗͚̙̭̮̥̭̫̈́̂̏̂̑̌̆̌͊̋̑̃̋̚͘͜͝l̛̘͉̗̺̂̋͊́̈̍̔̈́̅͜͝a̶̪͉͉̗̯͌͌͌̎͑̈̈̌̈́͗̂̽̚͜a̸̛͉͗̅̅̋͂̈́͘̕͜e̷̵̛̬̰̗̭̹̦̩̯̤͇͗̃̌̃́̐͌͗͠cn͈̚e̸̢̨̯̹̘̝̺̰̯͓̘̠͓̯̗̹͎̫͎̭͂̓̾̎̃̑̚͘̚͜͝͠͝͝͝a̶̴̷̢̨̛̛̹͚̲̫̤̠̦̲̫̭̫̫̯͕̙͖̯͌́̈́̅̏͌̃̂̄̃͒͌̆͜͠͝͝͝͠h̥(Ljava/lang/Object;)Landroid/content/res/Configuration;

    move-result-object v1

    invoke-static {v1}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->n̶͉̼̥̫̫̘͆͊͊̈͐͐̌͜͜K̥͉̐̀̆͗h̴̶͓͑ä̸̛̹̱͈̉͜ͅK̹̂Pơ̢͎͕͓͆̂͒ű͈͚K̺̺̄ç̧̖̤̯̥͎̫̂̈̽͌̒̈́͌̿͜͜͝ǎ̻̙͎̼̂̂̑̂̽͝K̵̈́c̸̸̴̴̸̶̡̢̧̛̘͎͈͓̥̲̼̯̱͚̭̻̙̫͑͗̾̌͐̅̅͋̈͋̒̅͊̌̚͜͝͝P͕̈́̂̆l̶̩̅͌̾͋̓͜͜ë̞͚́ņ̸̻̋̇̈̈ą̷̸̸̵̷̸̸̸̨̢̛̩̯̦̱̠̫̙̫̗̹̪̻͚̯͕͎̺̘͈͓͕̯̺̀̈͐̈́̋̈́̑͑̓͑̂̈͑͌̐̅̄̿̚͜ṵ͝ư̸̢̠̭͙̤̖̿̂̄̾̋̂̅̕͜l̫͑Pn̸̸̢͖̤̙͎͕̗̥̰̗͕̞̠͉̮̘̫̬̂͋̿̌̈͌͑̒̋͘͝͝P̥̈́͘͝a̧͎̥̘̹̫̋̋̋̆͝B͉̺̾(Ljava/lang/Object;)I

    move-result v1

    and-int/lit8 v1, v1, 0x30

    const/16 v0, 0x20

    if-ne v1, v0, :cond_0

    const/4 v1, 0x1

    return v1

    :cond_0
    const/4 v1, 0x0

    return v1
.end method

.method public static l̘͈̱̾̈̈n̊ö̡͎̼̺̭̯̥̻͚̥͉̯̦́̑͐̎̋̽̑̚ả͖̞̱̫̠̄̋͗͝͠ȟ͈e̥ḧ̛͓͈͉̫͉̗̱̮́̏̅͘͝ḧ̛̯̺̖̲͉͉͈̂̎̋͂̂͊̋̃͊̚͜͠o̷̵̸̡̢̭̹̦̠̹͌̃̂͊k̸͚͋͝c̗̻̥h̶̭̲̔̄K̶̨͙̠̫͙̜̺̫̱̔̊͐̄́̎͌̍̎͒̂͝͝͝K̨̺pk̯̎ö̧̧̭̲̑͐̄͒͗̅͜͝͝ț̈́̈́c̴̢̺̫̑̅͝Ķ̴̡̦̔̓̽̈̈͠ȃ͓̺̗̕K̶̭̥̯̰͉̺͗͌͌̎͂̔̔͗̑̄̓͆͠c̫̫̦͉̀u̶̻̩̮̼̍̈͜ḁ̧͂̑l̷̸̴̡̧̨̮̱̥͓̠̜͈̼̱̫̯͓͚͙̪͕͚̮̫̭͊̋̑͌͋̄̌́̈̀̌̏͗̆͐̄̃̂͗̆̂̚̕͝͝͝ļ̧̭̲̱̩̮̈͌͒̌̊͒̅()[S
    .locals 1

    invoke-static {}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->P͉ķ̩͕̥͋͗ą͉͕̥̥͎̜̈̅̈́͝k̵̷̨̨̧̧͖̞̥͈̮͓͎͎̪̂͑̑̂̓̐̂̋͝͝ṋ̵̢̢̡̥͕͊́̎̌Ķ̷̶̛̙̫̦̪̙̟̺̎͌̑̋̌͑̂̎͘ơ̸̦̥̂̈́̔̚͠͠ë͈̮͋̄̾Kh̶̷̸̗̫̤͕͚͚̘̞̮̄̋̄̐̓̋͑͗͐K̂p̵̷̪̘̱͕̰͈͐̄̕͘͜͜PB̨̛̘͕̗̫͉̱̫͙̥̯͕͕̰̘̤̤̦͗͗͊̃͋̆̃͐͗́͠B̷̷̤͇̹̋̅̄̋͜͠t̴̤̙̚Ķ̶̧̩̙̮̩̤̩̭̺̺̮͈̍̈͌̂̋̒̔̂̒̿̍̏̌͌̚͝͝at̖̥̠͕͌͊a̸̰̱͂̈́ȩ̶̶̛̛̛̺̩͉̖̱̦͈̫͙̫̥̻͎̯̈̋͌̄͑͂̿͗̌̅͑͂̍̉͘͘̚͜͜͜͝K͚̦̦̫͙̘̺͗͆̅͐̆Ǩ̢̘̠̫̜̼̦̅̅̚()I

    move-result v0

    if-gez v0, :cond_0

    sget-object v0, Lcom/android/settings/kashi/Utils;->short:[S

    :goto_0
    return-object v0

    :cond_0
    const v0, 0x0

    goto :goto_0
.end method

.method public static p̵̧̛͇̪̰̱̿͘͝͝a̗a̸̫͓̯̭̪̾̀̐̉͝k̸̷̢͚͉͓̭̘̗̥̖̺̫̫͚̪̙̼̬͂̎̋̂̏͐̎̈͐͐̈́̚͘̚̚͝ă͈̎k̡̞̺Ḱ̸̷̶̸̙͈͎̤̤̭̼̹̐͗̕͜͝K̃̄͐͜aP̖͗̏͝͝n͓͚̜̯̭̥͓̙̫̥͈̂͗͌̈́̌̌͘͜͝a̶̵̸̶͖͚̫̋͐̑̾͘͝a̩͆̈́͗l̵̴̶̲̹͇̫͚̻͚̫͐̑̂̅̾̈́̈́̒̂̋ͅţ̷̨̻̮͈̫̯͖̫̹̀̎̌͊̂̀͒́̌̎̋͑̌̚̚̚͜͠o̸̴̢̦͚̤͉̲̫̗̯̼͌̑̋̌̈̉̍̚Ḃ̧̛̙͎̯̗̬̫͎̗͎͉̊̎̂̅̈́̏́̃̔̋̕͜͝͝P̷̬̫̫͚̖̩͑̂̈͋̌̾̑͝͝K̥̄̆̂͠k̷̵̸̨̹̥̺͉̰̮̼̱̩̯̀̂̑̓̎͒̂̂͌̇̌̌̎̏͗͐̿͘͠(Ljava/lang/Object;III)Ljava/lang/String;
    .locals 1

    invoke-static {}, Lcom/kashi/settings/view/AboutSettingsHelper$2;->ok̸̷̷̫̼̘̹̱̀̈͘ç̸̴̸̴̶̧̧̱̮̮̆͑̔͑̄̊ȩ̵̶̡̺͑̾̎̏̅́̔͠n̨̰̜̱̎͊̀̔̐̀̈̌̌͘t̷̸̨̥̘̠̖̬̯̘͌́̽̈́̾̊̎̃̚͝͝Ǩ̷̫̫͚̤̻̪́͒͒͐̄̄͌̋͠͠à̟̠̱͗͘Ķ̷̧̨̨̛̛͎̭͎͉͐̿̑̃̎̈́̊̐̀͘͘̚͜͝n̦͋͝P̸̸̸̸̴̷̧̧̧͎̫̦͎͓̫͖̫͕̘̪̪̺̺̼͖͓͖͎̫̌̿̌̈̈́̀̀̂̿̎̌́̋̊̌̍̌̔̈͘͜͝͝oḁ̴̅̔̈́h̴̘̫͖̪͎̀͝a̸͈̎̋̉͜ą̸̮̪̗̲̮͋́̑͐͜͝ḱ̷̯̈́͗ą̷̸̶̸̨̛̙̱̤̯̭͚̙̭̱̯̯͓̺̇̈͒̋̂̄͌͌̈́̋̂̎̑͐̈́̈̕͘͘͜͠͝͝ͅoP̸̶̫̬͕̙̯̎̽͐͆̾̿̎̚͜͝ͅ()I

    move-result v0

    if-ltz v0, :cond_0

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->K̸̷̵̴̷̛͎͎̙͓̯̤̝͓̱̲͒͂̿̋̂̀͗͜͜P̀̿h̷͕͚͂̄a̸͎̼̯͓̍͂͆̿̕͝͝a̷̸͎̯̩͓͈̘̯͗̇uä̵̵̢̩̫̤̭͓̺̮̝͖̐̈̊̋͋͗͒̎̾͜͝o̵̵̥̭̭̲̪͓̲͗̄̾̿͒͗͌̇̎̇͌̌̅͂̂̕͜͝͝B̧͉͕̌͒̿̍̂̂̑̌͊ḧ̪̯̫̭̩́̂̚P̂͂̅c͘n̴͉̂̂k̦͈̂̌̈ţ̛̫̄̾̍K̸̙̈́͌́̃͜ţ̴̧̗̯̗͈̺̫̮̈́̂̈̿̋͌̾̋͊̚͜͝ö͈́̂a̸̵̚͝B̼͕͈̀ȇ̺͐͝t̸̸̢̛̰̗̰͓͚̫̯̦̠̙͓̖̭͓̬̎̂̈́̈͌͌̑́͂̈́́̐͋̋̂́̃̐̈̄̈̚͜͜͝p̶̸̛̺̦̫͌̆̎̔̔̇̌̈͑̾̈́͂͌̿̕͝͝c̷̛̛̗͙͋̓́̌̀P̢̱͈̰̾͂̎([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_0
    return-object v0

    :cond_0
    const v0, 0x0

    goto :goto_0
.end method

.method public static setVersionCardBgElement(Lcom/android/settings/device/MiuiVersionCard;)V
    .locals 53

    move-object/from16 v2, p0

    invoke-static/range {}, Lcom/android/settings/kashi/Utils;->l̘͈̱̾̈̈n̊ö̡͎̼̺̭̯̥̻͚̥͉̯̦́̑͐̎̋̽̑̚ả͖̞̱̫̠̄̋͗͝͠ȟ͈e̥ḧ̛͓͈͉̫͉̗̱̮́̏̅͘͝ḧ̛̯̺̖̲͉͉͈̂̎̋͂̂͊̋̃͊̚͜͠o̷̵̸̡̢̭̹̦̠̹͌̃̂͊k̸͚͋͝c̗̻̥h̶̭̲̔̄K̶̨͙̠̫͙̜̺̫̱̔̊͐̄́̎͌̍̎͒̂͝͝͝K̨̺pk̯̎ö̧̧̭̲̑͐̄͒͗̅͜͝͝ț̈́̈́c̴̢̺̫̑̅͝Ķ̴̡̦̔̓̽̈̈͠ȃ͓̺̗̕K̶̭̥̯̰͉̺͗͌͌̎͂̔̔͗̑̄̓͆͠c̫̫̦͉̀u̶̻̩̮̼̍̈͜ḁ̧͂̑l̷̸̴̡̧̨̮̱̥͓̠̜͈̼̱̫̯͓͚͙̪͕͚̮̫̭͊̋̑͌͋̄̌́̈̀̌̏͗̆͐̄̃̂͗̆̂̚̕͝͝͝ļ̧̭̲̱̩̮̈͌͒̌̊͒̅()[S

    move-result-object v32

    const v35, 0x1ab633

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper$2;->ơ̵̢̫̱̩͈͈̥̭̻̂̃̎̌a̦̒͗͜͝B̥̲̾̋̌̃̄̕͝B̶̛̋̚B͌̾̚B̮͉͕̜̗̔́̃̄͜͝ȃ̠ã̸̴̶̸̵̧̛̻̹͚̟̮̪͕̄̋͊̾̈̿̚͝ͅo̸̸̮̫̅̈́͆̅͑͜o̴̸̢̤͎̫̜̺̪̫̟̻̺̖̭̹̫̟̎̃̔͑̏͗͗̔͑͗͂̑̕͜͜͜͝c̸̰͈͎͙͈̞̅́̐̍̈͗͗͑̋̂̀̂͑̆̀͂͘͝͠͝͠ͅp̫̝͈͕̗̘̙̋̐̋̃̐̃͘p̼̺͙̫̃K̴̴̸̻̪̹̼̺̙͚̋̅̄͋̂̀̈̈͑̈́̍͒̎̈̂̂̿̏̌̂̀̚a̸͉͎̱̹̦̮͚͌̈́͌̐̓͗͌̏͌̂̍̚͜͜͠͝͝ͅa̸͎̲͉͕͉̭͎̎̃̍̑̑͑̾̈͋̔͜K̴̴̢̧̢̛̛̭̺̱̫͚͈̯̗̗̠͚̺̹̎̌͊̎͑̒͆́̈̂͗̌̿̌͘͘͘͜͝a()Ljava/lang/String;

    move-result-object v31

    invoke-static/range {v31 .. v31}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v31

    xor-int v35, v35, v31

    const v33, 0x1abd84

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->a̶̷͇̲̰͚̥̹͐͌͝a̸̷̶̷̵̢̧̛̹̯̜̮̫̱̭͓̺̩̺̫̹͈͚̬̭͓̫͑̌̂̈̂̌̑̑̄̅̐͑̋̽͗̈͑͘͝͝͝ͅͅp̫̱͗̅̂P̢̭̞͉̿̋̎͌͑e̹͐a͉̾̾̿̀͝K̮a̴͈̩̐̓̀͌̚h̋ḧ̸̷̢̨̥͇͖̱̫̻̝̰͚͚̗̦́̈́̌̈́̍͂̔̈̏̂̀͆͊͌̎̌͊̚͝a̢̞̥̎͗̄͗̓̌͋͆̚͝͝ä̸̷̧̰̠͎̦̯́͌̀̆͒̍͗͋͜t̸̯̹͚̘͊͑̿̏ơ̧͕̜̹͓̂͗͌̕B̶̴̯͚͎̑̅͝͝a̩̥͚͖̍͒͂̀ẻ̸̛̩͕͌͗̃͗p̷̷̸̸̷̷̨̧̢̨͙͚̤̺̲̦͈̺̹̞̦̺̘̠̫̻̂͗̈́̋͌̀̾̿͊̑̎͊̈̋͠͝͠h͓̖͚͐Kơ̢̹̭͕͊̀͜͝h̶̡̛̹̹̬̑̊̍̎̋̐̿͋̍͜͜͝()Ljava/lang/String;

    move-result-object v31

    invoke-static/range {v31 .. v31}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v31

    xor-int v33, v33, v31

    const v34, 0x1ab69e

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper$2;->a̢̧̗̹̻̭͓̝̔͐͒̈̾̎̏͝͝ṋ̮̯́̿́͝h̷̛̺͈͙̠̹͖̫̹͕̖̼̑̋̅̑͑̑͌̋̇̈́̑͑̈͌̕͠͝ͅn͐h̷̸̢̛͇̠͚̯̹̺̥̠̾̈͑͂͗̋͒̎͋̈͘͝͠ķ̢̫̦͚͋̄̈́͑̈́̂̆͝h̵̠̠̬͈̫͙͒͒͑͑́̏a̸̡̤̜̩̬͖̗̐̂͌͗̋̎̅͐͊o̻̊̂͘K͎̽̌̋B̶̫͓̈̎̈́͋o̴̧̺̥̹̠̅̍̂͝e̴̸̞͎̞̺̔͌͋͌͋̈̚͜͜͝͠ẵ̷̵̸̸͉̲̻͈̭̙͚̺͉̗̖̩̦̥̮͓̺͎̹̹̯̭͑̑̉̌̌̍̈́͒̋̋̾̿̌͌͋͜͝ṯ̬̋ǫ̵̸̨̫̹͈̥̥̩̹̥͓͕͋̌̑̂̉̋͋͂̄̋̂̀͜͜͜͝ḵ̵̢̢̛̙̹̖̱̱͗͑̈a̫͎̜͚̖͌̚͘o̸̢̦̮͚̮̮̙͆͋͐̐̑͘͘͠()Ljava/lang/String;

    move-result-object v31

    invoke-static/range {v31 .. v31}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v31

    xor-int v34, v34, v31

    invoke-static/range {v32 .. v35}, Lcom/android/settings/kashi/Utils;->p̵̧̛͇̪̰̱̿͘͝͝a̗a̸̫͓̯̭̪̾̀̐̉͝k̸̷̢͚͉͓̭̘̗̥̖̺̫̫͚̪̙̼̬͂̎̋̂̏͐̎̈͐͐̈́̚͘̚̚͝ă͈̎k̡̞̺Ḱ̸̷̶̸̙͈͎̤̤̭̼̹̐͗̕͜͝K̃̄͐͜aP̖͗̏͝͝n͓͚̜̯̭̥͓̙̫̥͈̂͗͌̈́̌̌͘͜͝a̶̵̸̶͖͚̫̋͐̑̾͘͝a̩͆̈́͗l̵̴̶̲̹͇̫͚̻͚̫͐̑̂̅̾̈́̈́̒̂̋ͅţ̷̨̻̮͈̫̯͖̫̹̀̎̌͊̂̀͒́̌̎̋͑̌̚̚̚͜͠o̸̴̢̦͚̤͉̲̫̗̯̼͌̑̋̌̈̉̍̚Ḃ̧̛̙͎̯̗̬̫͎̗͎͉̊̎̂̅̈́̏́̃̔̋̕͜͝͝P̷̬̫̫͚̖̩͑̂̈͋̌̾̑͝͝K̥̄̆̂͠k̷̵̸̨̹̥̺͉̰̮̼̱̩̯̀̂̑̓̎͒̂̂͌̇̌̌̎̏͗͐̿͘͠(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v32

    move-object/from16 v0, v32

    invoke-static {v2}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->ca̵͖̺͈̲̖̖̽̋͑u̵͙̯̬̫̪̮͎͎͖͋̇̂̃̐͌̿̋̎͋̈́̋̚͝͠Ķ̶̧̛̛̛̲̰͉̙̫͓̭͓̂̎̂̿͊̇͌͌̃̃̅͊̋̍̾̅̎͌̌͌̀̂́̿̌͜p̵̶̶̨̧̢̛̛͙͙͚͉̗̘͚̮̟͙͉͌̐̿͑̔̎͊̈́͋̈͘̚͜͜͜͜͜ǒ̷̸̯̫̩̘̠͗̂̋̈́̋̚͜ū̸̷̸̸̸̢̢͙͎̭͈͕̥̘̗͕͓͗͂̿̂̂̅̈͊̋̍̈́̎̑̌͝͝K̸̷̢̧̧̮̜̗̭̮͚͚̫̰̾͗̆͌ą̸̷̴̸̵̸̧̢̨͚̖̭̯͙̻̱̭̪̼̱̹͎͚̖̗̩̹̺̦͙̗̥̲̯̥̮͕͈̃͌͗̾̅͒̾̏̀̾̂̅̏̂̅̍͐̔̀̌̈́̚͝͝k̫̻͗̎ų̷̶̢͙̮̲͕̼̹̗͉̜͙̤̥̥̂̿̑̅̈̌͐̃͋̑̐̾̋̈̒̄͒͌͘͜͜͠͠p͈ẖ(Ljava/lang/Object;)Landroid/content/Context;

    move-result-object v1

    invoke-static {v0, v1}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->K̶̨̫̘̞̖̲̻͚͉̂̀̄̚e̸̴̢̧͓̗̠͚̫̗̖̫̋̅̌̈̍̎̈͐̉͜͜͜͜͝ţ̧͎͓͕̠͈̈̽̾̑͒̔̈̍͆̅̈́̔͂͐̈̔̒͝õ̸̤͎͐͋a̟̪͚͎͓̼̭̖̍̄u͑͒ķ̧̹̩̥̥̥̌̌̂͋̈́̃̈́̚͜l̷̸̛̲̮̺̗̯̰̦͕̈́͋́̑̋͑̈́̽̿̀͋̕͠͝͝ą͎̘̯̂̎́͋̀͗̋̒͝eK̾͂̍̎̈́͜à̴̪̺͓͎̥͚̪̻̑̅̈́̋̒a̴̴̛̫̯̥̙͋̀̈́͗̿h̵P̸̢̛̩̼̫̱̬̹̙̫̩̱͚͙̰͋̌͌͋̏̾̈́̋̎̑͗̽̚̚͜ä̦̭̝́̎ȃ̵̵̸̸̧̧̧̧̻̩͈̩̼̮̭͓̭̲̦̦̰̹̫͎̘͎̠̲̖̦̗̖̬̦͈̪̭̝̋̃̈́̄̑̄̌̂̿̐̋̑͑͊͑͋͐́̎͋̿̅̃̍̑̌̆̚̚͘̚͘͜͝͝(Ljava/lang/Object;Ljava/lang/Object;)I

    move-result v0

    invoke-static {v2, v0}, Lcom/kashi/settings/view/AboutSettingsHelper;->o̴͌â̴̷̴̷̷̧̭̺͕̜̦̗̯͓̭̱̗͉͈̫͙̖̻͋̏̆͑͑̾̈̋̓̈́̓̑̾͌̌̈́̍̕͝͝K̶̛͑̋̋c̠̦̙̙͝o̢̼̻͋k̵̵̷̢̺̬͖͈̥̐̇͑̚͝͠͝ä̶̜͈̺͈́̃̂͗͊̅̀̈̐̋́o̸̸̶̶̷̸̸̧̲͕̖̤̰̭͎̰͈̪̬͓̰͙̫̱̬̙͈̺̍͌̏̾̈́̄̅̊͋̔̎͑̋͋́̿̓͌͗͜͠͝͠͝P̱̭̯͌͌͌͋a̹̦̰̼͓̿̋̅́̈́͗̿̎̚͜͜͠ǎ̢̤̼̺͚̦̙̺̃̏͋̿̾̀̅̋́̈̈͘͠ą̧͈̤͚̼̰̗̻̠̻͎̗͈̯͙͚̞͋͑̋̑́̑̈́͂͗̃͌̕͝B̛̪̖͑̀̽͐̓̋c̫̻k̴̯̭͉̃̎̏͝k̢̦̘̈̔aḩ̥̫̺͉̆̃̾͗͜͝ö̷̧̧͈̙͚͎̠͙͇̐͌̾K̨͈̫̜̥̝͌̂͒͝(Ljava/lang/Object;I)Landroid/view/View;

    move-result-object v0

    invoke-static {v0, v2}, Lcom/kashi/settings/view/AboutSettingsHelper;->P̧u̴͚̤̯̅̒̃̃́̈́̑̈́̅̚͜k̸̶̮̩͕̻͉͎͕̼̯̹̃̄̌̌̈̈͐͌͜͝͝͠a͓̍ā̶̸̷̧̛̘̯́͘͝a̸̼͇̺͑͋̉̚͘͜ȩ̷͕͚͚̽͝ư̤͎̱̓̉͑̈̀͋͐̋̌͘͝e̛͕̯̪̹̗͌̑̔̌̒̾̇̽̈́̾͌́͝ȃh͊B̛͓͆̀̑̾͘͜͝ě̷͈̘͎͓̎̑͊̅͒́͘̚̕ẽ̶̪̩͓͌̑̈́̊͘uä̷̸̷̢̨̛͈̰̩͚̮̼͕̈̌̌̄̿̑̏̽̄͝å̸̶̶̢̦̫̗̘͙̘̋̋̿̍͗̀̔͗̋̚͜͝a̛c̷̴̸̵̨̧̧̛̮̠̻̯̥͕̹̺̭͎͎̜̠̯̰̺̔͒͋̋̑̌͗̄̋̌̑̌͑̈̏̈͋̌͒͋̔̚͘͘͘͜͜͝͝͝á̴̧̲̪̖̫̘̱͋̆̈́̌͗̑̀̈̂̂͂͠͝ȏ̵̤P͚̘̯̀̂̓̀̏̄͝͠(Ljava/lang/Object;Ljava/lang/Object;)V

    invoke-static/range {}, Lcom/android/settings/kashi/Utils;->l̘͈̱̾̈̈n̊ö̡͎̼̺̭̯̥̻͚̥͉̯̦́̑͐̎̋̽̑̚ả͖̞̱̫̠̄̋͗͝͠ȟ͈e̥ḧ̛͓͈͉̫͉̗̱̮́̏̅͘͝ḧ̛̯̺̖̲͉͉͈̂̎̋͂̂͊̋̃͊̚͜͠o̷̵̸̡̢̭̹̦̠̹͌̃̂͊k̸͚͋͝c̗̻̥h̶̭̲̔̄K̶̨͙̠̫͙̜̺̫̱̔̊͐̄́̎͌̍̎͒̂͝͝͝K̨̺pk̯̎ö̧̧̭̲̑͐̄͒͗̅͜͝͝ț̈́̈́c̴̢̺̫̑̅͝Ķ̴̡̦̔̓̽̈̈͠ȃ͓̺̗̕K̶̭̥̯̰͉̺͗͌͌̎͂̔̔͗̑̄̓͆͠c̫̫̦͉̀u̶̻̩̮̼̍̈͜ḁ̧͂̑l̷̸̴̡̧̨̮̱̥͓̠̜͈̼̱̫̯͓͚͙̪͕͚̮̫̭͊̋̑͌͋̄̌́̈̀̌̏͗̆͐̄̃̂͗̆̂̚̕͝͝͝ļ̧̭̲̱̩̮̈͌͒̌̊͒̅()[S

    move-result-object v15

    const v18, 0x1ab9f1

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->ả̷̶̵̯̬̱̼͚͉̱͕͎̭̹͉̞͆̃͂̆̑̈͝u̵̥̩̗͌̈́ȍ̵̢̫̤̱͎̫̹̺̺͙̅̀̂͐͜͝ḁ̴̶̛̛̰̌̀̎̈́̑͌̌̚̚͝͝͝ȗ̶̶̸̧̨̡͚̻̲̯̮̲͈̥͇͎̦̫̂̈̌͌̋̐̿̀̀̃̂̚͜ḩ̯̖̮͒͌͆̈́̕n̶̶̶̸̨̛̫͈̯͉̠͈̫̈̾̋̑͌͑̂͗̾̈́̚ͅB̴̷̵̨̧̡̢̛̘͙͈̥͓̥̖̫̗͚̼̪̯͚̭͕̭͈͗̌͌̈̌̀͋̍̋̃̑̓͗̆͊̌̈̄͘͘͘͜͜͜͜͜͠͝͠K̫͓͚̺͗͋̀͝ǎ̯̭͚̫͈̖̼͈̂̌̃̍̀̚e̫̘͈̥̠̪̖͌̿̒̑̌̈́͂̿̃̋͗͠͝pa̘o̢̰͖͂p̹̮a̔͗è̢͚͎̋̈͘͜ȩ̸̢̢̬̠͙̋͋̑͑̒̈́̂͝͝ơ̸̡̧̥͓͕̦̤̜͌͋̈́͋̈́̇̈́͘()Ljava/lang/String;

    move-result-object v14

    invoke-static {v14}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v14

    xor-int v18, v18, v14

    const v16, 0x1abe3b

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper;->Ķ̭̪͕̗h͊P̏ǎ̢̧̛̩̝̯͚̗̭̫̥͇̻̘̯͖̲͗͊̔̃̃͋͗̈́͑̿͗̌̋̑̕͝͝e̫̦̿̃̇̀K̸̸̴̵͎̠̘̩̜̪̟̦̮̫̯̭̅̈́̋̈́͂̂̅͌̎͠B̙̥̆̌̈́e͎̦̼͝B̸̛̗͉̘͕̥̂̈̌̄̋̏͝͝ã̴̸̦̗̖̺̮͆͐͌͋̈́̌ǩ̬̭̘͚̈́̂̋̽a͘l̮͈͈̲͈̹̾͌̂̓ą̶̶̧̯̠͚̭̰̪͚̑̊͐͗̀̏͋̈͌̚ớ̢̡̭̝̈́́͑́̎͜p̷̷̶̛̛̮̱̙̲͈̺̩̬̎̉̔̋́̾͜͜͜͝͠ţ̭̠̦̼̜̖͙̰̮̙̟͌̀̃̆̈́̽͘͜͜t̛͌̂ç̸̫̙̙̉͗̍͑̏̑̓̎̏̑̈̚͠ä̧̺̯́͗̉͌̆͜͝o̢̫ah̴̢̨̠̰̼̥̫̘̾̋̂͆̑͘B͎u̪̪̅a̡̯̮͈͂̈́́̾̅č͋()Ljava/lang/String;

    move-result-object v14

    invoke-static {v14}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v14

    xor-int v16, v16, v14

    const v17, 0x1aabba

    invoke-static/range {}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->a̻c͉̋K̮͌͝a̷̧̧̮͈̗̗̬̩̰̮̫͒͌͆͗͋̾̂͜k̴̷̽́͑̄͝K͈̚ȗ̢̙̱̖̺͌̾̾̂̂͆̀a̛̘̺̮̐o̱̟̐́̑͝B̸̷̞̗̪̗̗̫͖̑͑͗͋͒̂̌̈̿͠ç̶̞̦̗̱̻̟͗̐̍̌̄̐͜͠c̸̸̶̛̛̛̻̭̯̭̹̐̽̐͋͘͝P̶̧̢̛̛̻͇̱̙͉̗̫̠̙͕͓͚̯͈̩̺͎̗͙̥͎̮̭̱̘̺͋̐̑͗̒͐̑̎͌̍̿̊̈̂̈́̄͘͜͜͜͝͠͠a̶̶̸̧̺̦̠͓̻̘̠͎̱̯̻̘͑͗̈́̃̈̋͒̔̆̌͑̚͜͜͜͝͝͝͝͝e̷͚̫̠͗̂͋c̛̰̬̲̪̤̫̲̺͋̑͋̆̄͗͑͝P̸̷̢̧̗͓̥̫͚͚̿̎́͗͌͗͠ṷ̷̉̎̔̀̎h̑ü͕Ķ̶̗͒̈̂̿̀̋͌͌͝a̸͚̦̦̜̐̋̂̄͗̌̈̑͘()Ljava/lang/String;

    move-result-object v14

    invoke-static {v14}, Lcom/android/settings/kashi/Utils;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;)I

    move-result v14

    xor-int v17, v17, v14

    invoke-static/range {v15 .. v18}, Lcom/android/settings/kashi/Utils;->h̼̹̘̹̬͗̂̌̈́̈̃â̶̸̙̺̲̹̌̏̂̌̈̐͝͠o̷̵̷̸̦̎̂̑̆̍͠͠͠c͙͜ơ͇͎̪͓̪̫̦̈́̆̈́̏̑Kc͚̾P̧̯̘̫͋̂̏͝ǎ̷̧̛̯̯̦̲̺̯͈͉̹͚̺̱͗͗̎͗̔̓̈́̂͝͝p̸̶̶̨̟͉̼̖͖̩̹̺̲̥̫̊̽͑̆̄̆͗̋͜͠͝͝o͌ê̷̸̢̢͎̹͈̫̮̮͈̹̙̘̥̱̑̏͂͌̂̑̌̔͐̿͝c̛̲̝̠͎̝̑̈̅̋͝ḁ̸̛̟̲͊̂͑́̈́͊̃̈̾͘͜͝͝ņ̸̸̸͙̝͈̮͓̻̮̼͖̪̱̐̀͗̌͊̈́̑͂͘p͕̜̘̾̉̂̋̓͠eKB̸̷̶͚̯͈͚̫̱̫͌̃̾͝oK̛͓͙͈n̗̤̜̺̈́͘ȟ̸̷̵̸̶̴̛̭͖̯̘̫̮͉̭̫̗̑̌̃̌̾̐͂͑̔̌͌̚͘͜͝ͅͅͅn͝P͓K̘̖̟͗(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v15

    move-object/from16 v0, v15

    invoke-static {v2}, Lcom/kashi/settings/view/AboutSettingsHelper$3;->ca̵͖̺͈̲̖̖̽̋͑u̵͙̯̬̫̪̮͎͎͖͋̇̂̃̐͌̿̋̎͋̈́̋̚͝͠Ķ̶̧̛̛̛̲̰͉̙̫͓̭͓̂̎̂̿͊̇͌͌̃̃̅͊̋̍̾̅̎͌̌͌̀̂́̿̌͜p̵̶̶̨̧̢̛̛͙͙͚͉̗̘͚̮̟͙͉͌̐̿͑̔̎͊̈́͋̈͘̚͜͜͜͜͜ǒ̷̸̯̫̩̘̠͗̂̋̈́̋̚͜ū̸̷̸̸̸̢̢͙͎̭͈͕̥̘̗͕͓͗͂̿̂̂̅̈͊̋̍̈́̎̑̌͝͝K̸̷̢̧̧̮̜̗̭̮͚͚̫̰̾͗̆͌ą̸̷̴̸̵̸̧̢̨͚̖̭̯͙̻̱̭̪̼̱̹͎͚̖̗̩̹̺̦͙̗̥̲̯̥̮͕͈̃͌͗̾̅͒̾̏̀̾̂̅̏̂̅̍͐̔̀̌̈́̚͝͝k̫̻͗̎ų̷̶̢͙̮̲͕̼̹̗͉̜͙̤̥̥̂̿̑̅̈̌͐̃͋̑̐̾̋̈̒̄͒͌͘͜͜͠͠p͈ẖ(Ljava/lang/Object;)Landroid/content/Context;

    move-result-object v1

    invoke-static {v0, v1}, Lcom/kashi/settings/view/AboutSettingsHelper$4;->K̶̨̫̘̞̖̲̻͚͉̂̀̄̚e̸̴̢̧͓̗̠͚̫̗̖̫̋̅̌̈̍̎̈͐̉͜͜͜͜͝ţ̧͎͓͕̠͈̈̽̾̑͒̔̈̍͆̅̈́̔͂͐̈̔̒͝õ̸̤͎͐͋a̟̪͚͎͓̼̭̖̍̄u͑͒ķ̧̹̩̥̥̥̌̌̂͋̈́̃̈́̚͜l̷̸̛̲̮̺̗̯̰̦͕̈́͋́̑̋͑̈́̽̿̀͋̕͠͝͝ą͎̘̯̂̎́͋̀͗̋̒͝eK̾͂̍̎̈́͜à̴̪̺͓͎̥͚̪̻̑̅̈́̋̒a̴̴̛̫̯̥̙͋̀̈́͗̿h̵P̸̢̛̩̼̫̱̬̹̙̫̩̱͚͙̰͋̌͌͋̏̾̈́̋̎̑͗̽̚̚͜ä̦̭̝́̎ȃ̵̵̸̸̧̧̧̧̻̩͈̩̼̮̭͓̭̲̦̦̰̹̫͎̘͎̠̲̖̦̗̖̬̦͈̪̭̝̋̃̈́̄̑̄̌̂̿̐̋̑͑͊͑͋͐́̎͋̿̅̃̍̑̌̆̚̚͘̚͘͜͝͝(Ljava/lang/Object;Ljava/lang/Object;)I

    move-result v0

    invoke-static {v2, v0}, Lcom/kashi/settings/view/AboutSettingsHelper;->o̴͌â̴̷̴̷̷̧̭̺͕̜̦̗̯͓̭̱̗͉͈̫͙̖̻͋̏̆͑͑̾̈̋̓̈́̓̑̾͌̌̈́̍̕͝͝K̶̛͑̋̋c̠̦̙̙͝o̢̼̻͋k̵̵̷̢̺̬͖͈̥̐̇͑̚͝͠͝ä̶̜͈̺͈́̃̂͗͊̅̀̈̐̋́o̸̸̶̶̷̸̸̧̲͕̖̤̰̭͎̰͈̪̬͓̰͙̫̱̬̙͈̺̍͌̏̾̈́̄̅̊͋̔̎͑̋͋́̿̓͌͗͜͠͝͠͝P̱̭̯͌͌͌͋a̹̦̰̼͓̿̋̅́̈́͗̿̎̚͜͜͠ǎ̢̤̼̺͚̦̙̺̃̏͋̿̾̀̅̋́̈̈͘͠ą̧͈̤͚̼̰̗̻̠̻͎̗͈̯͙͚̞͋͑̋̑́̑̈́͂͗̃͌̕͝B̛̪̖͑̀̽͐̓̋c̫̻k̴̯̭͉̃̎̏͝k̢̦̘̈̔aḩ̥̫̺͉̆̃̾͗͜͝ö̷̧̧͈̙͚͎̠͙͇̐͌̾K̨͈̫̜̥̝͌̂͒͝(Ljava/lang/Object;I)Landroid/view/View;

    move-result-object v0

    check-cast v0, Landroid/widget/TextView;

    invoke-static {}, Lcom/kashi/settings/view/AboutSettingsHelper;->a̷̭͈͋͠k͕̱͚̫̅̈́͑̋͑̑̑̔̋̌͊͗ͅẽ̸̛͈͚͖̘̈́̌̆͒͂͆̃͗͘͘o̠̥t̴̛̛̲̫̫͌͌̋̅͒͂̄͜͝ͅa̷̵̶̧̧̗̫̗͎͎̥̘̫̦͗̾̌̃̇̄̏̑͗͋̈́͠͝B̵̴̼̋̋͋̋̚͠p͚t̮̀â̸̡͈͕̥͓͗͆͑̔̈́̓͘̚͜u̸͚͓̺̩͓̝͐̽̂̂͋ȃ̱̠̯̌h̷̸̛͎̹̭͗̑̎̆͝P̖ĉ͗̈͜o̭̫̺̔͋̃̂͌͜ó̩̂a̧̢̧̨̛̞̬̰̱̯͋͑̌͗͠͝ǔ̯͚͚ä̷̖̙̥̘͈̦́̃̋͌̂̄͊̑͗͜͜͝h̢̧̭͎̠̩̹̹̩͈̠͚̭̾̋͗̅̅͜͜͠͠͠l̩̭̋̈ͅl̸̡͓̦͓̞̖͓͉͚͒̎̂͗͊̈̌̂̈͜͜P̌aņ̴̠̥͓͖̫͊͑̈͊̑̋͝ak̵̗͚̰͗̃̌̌͑̾͘͘()Ljava/lang/String;

    move-result-object v1

    invoke-static {v0, v1}, Lcom/kashi/settings/view/AboutSettingsHelper;->K̛̘͉̥͚̘̮̄̋̌̀͒̋̕c̯c̶̷̨͓̫̱͈̲͌̈́̑̀̇̏̂̿̎̌̿͘͜͠͠K̸̶̶̢͖̩̘̩̲̲̺̈́͌͋̎͌̋̈̚͝p̸̴̶̢̺̩̭̤͚̠̰̩̯͚̫͚̮̙͉̯̻̯̭̥͚͚͌͑͌̾̀͋̑̈́̃͌̏́̓͌̚͠a̠͓̠͑̌p̷̡̱͖͎͚̄̔̎̌̀̍͜͠oK̸̢̙͎̹͓̯̥̞̖̗͎̗͎̮̖͚͙̔͗͌̂͗̿́̔̚͘̚͝͠ǎ̵̂̎͝͝ȧ̜͗̑p̷̶̷̸̧̧̧̢̛̛̯̻̭͙̩͕͎̫̝̯̫͕̞͚͎̫̙̼̱̺͕͇̏͊̑̈́̄̌̾̂͌̃̎̀͋̍͌̑͐̒̃̀͌̓͜͝͝͝͠k͈͚̂͋̕͝o̷̶̧̩̫͎̺̺̭̼̠̫͚̱̤̺̘̹͎̠̥̫̘̎̂͊̌̌͌̄̐̌̐̋̿̑̋̄͒͊͐̈̌̈́̂̌͑͘͘͜͝͠ot̸͗̋̚e͚(Ljava/lang/Object;Ljava/lang/Object;)V

    return-void
.end method
